
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>10. 概念 · 现代企业架构框架(MEAF)</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="9-appendix.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    README
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1/">
            
                <a href="Chapter1/">
            
                    
                    1. 引言：再提“业务平台化” 
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Chapter1/1.1.html">
            
                <a href="Chapter1/1.1.html">
            
                    
                    企业现代化趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Chapter1/1.2.html">
            
                <a href="Chapter1/1.2.html">
            
                    
                    业务平台化内涵向前演进
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="Chapter1/1.3.html">
            
                <a href="Chapter1/1.3.html">
            
                    
                    企业架构设计方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Chapter1/1.4.html">
            
                <a href="Chapter1/1.4.html">
            
                    
                    ThoughtWorks 发布现代企业架构框架
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chapter2/">
            
                <a href="Chapter2/">
            
                    
                    2. 现代企业架构框架（MEAF）
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="Chapter2/2.1.html">
            
                <a href="Chapter2/2.1.html">
            
                    
                    企业架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="Chapter2/2.2.html">
            
                <a href="Chapter2/2.2.html">
            
                    
                    企业架构框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="Chapter2/2.3.html">
            
                <a href="Chapter2/2.3.html">
            
                    
                    现代企业架构框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="Chapter2/2.4.html">
            
                <a href="Chapter2/2.4.html">
            
                    
                    现代企业架构框架设计原则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="Chapter2/2.5.html">
            
                <a href="Chapter2/2.5.html">
            
                    
                    现代企业架构框架元模型总览
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3/">
            
                <a href="Chapter3/">
            
                    
                    3. MEAF — 业务架构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="Chapter3/3.1.html">
            
                <a href="Chapter3/3.1.html">
            
                    
                    业务架构元模型综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="Chapter3/3.2.html">
            
                <a href="Chapter3/3.2.html">
            
                    
                    业务架构元模型应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="Chapter3/3.3.html">
            
                <a href="Chapter3/3.3.html">
            
                    
                    业务架构元模型补充说明
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4/">
            
                <a href="Chapter4/">
            
                    
                    4. MEAF — 应用架构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="Chapter4/4.1.html">
            
                <a href="Chapter4/4.1.html">
            
                    
                    应用架构元模型综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="Chapter4/4.2.html">
            
                <a href="Chapter4/4.2.html">
            
                    
                    应用架构元模型应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5/">
            
                <a href="Chapter5/">
            
                    
                    5. MEAF — 数据架构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="Chapter5/5.1.html">
            
                <a href="Chapter5/5.1.html">
            
                    
                    数据架构元模型综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="Chapter5/5.2.html">
            
                <a href="Chapter5/5.2.html">
            
                    
                    数据架构元模型应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Chapter6/">
            
                <a href="Chapter6/">
            
                    
                    6. MEAF — 技术架构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="Chapter6/6.1.html">
            
                <a href="Chapter6/6.1.html">
            
                    
                    技术架构元模型综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="Chapter6/6.2.html">
            
                <a href="Chapter6/6.2.html">
            
                    
                    技术架构元模型应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="Chapter7/">
            
                <a href="Chapter7/">
            
                    
                    7. 总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-ref.html">
            
                <a href="8-ref.html">
            
                    
                    8. 参考文献
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-appendix.html">
            
                <a href="9-appendix.html">
            
                    
                    9. 作者
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="10-concept.html">
            
                <a href="10-concept.html">
            
                    
                    10. 概念
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >10. 概念</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6982;&#x5FF5;">&#x6982;&#x5FF5;</h1>
<ol>
<li>&#x67B6;&#x6784;&#xFF08;ISO/IEC/IEEE-42010:2011 &#x6807;&#x51C6;&#xFF09; &#xFF1A;&#x67B6;&#x6784;&#x662F;&#x7CFB;&#x7EDF;&#x5728;&#x5176;&#x6240;&#x5904;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x6216;&#x5C5E;&#x6027;&#xFF0C;&#x4F53;&#x73B0;&#x4E3A;&#x5B83;&#x7684;&#x5143;&#x7D20;&#x3001;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x8FDB;&#x7684;&#x539F;&#x5219;&#x3002;</li>
<li>&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x89C4;&#x5212; (enterprise architecture planning, EAP)&#xFF1A;&#x901A;&#x8FC7;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7684;&#x89C4;&#x5212;&#x548C;&#x8BBE;&#x8BA1;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F01;&#x4E1A;&#x6784;&#x5EFA;&#x6574;&#x4F53;&#x7684;&#x6570;&#x5B57;&#x5316;&#x7B56;&#x7565;&#xFF0C;&#x89C4;&#x5212;&#x6570;&#x5B57;&#x5316;&#x9879;&#x76EE;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x5B57;&#x5316;&#x7684;&#x624B;&#x6BB5;&#x5E2E;&#x52A9;&#x5176;&#x5B9E;&#x73B0;&#x671F;&#x671B;&#x7684;&#x6218;&#x7565;&#x76EE;&#x6807;&#x548C;&#x4E1A;&#x52A1;&#x7ED3;&#x679C;&#xFF0C;&#x5F62;&#x6210;&#x4F01;&#x4E1A;&#x7684;&#x6570;&#x5B57;&#x5316;&#x9876;&#x5C42;&#x89C4;&#x5212;&#x4E0E;&#x8BBE;&#x8BA1;&#xFF0C;&#x6307;&#x5BFC;&#x4F01;&#x4E1A;&#x7684;&#x6570;&#x5B57;&#x5316;&#x8F6C;&#x578B;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x89C4;&#x5212;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x89C4;&#x5212;&#x3002;</li>
<li>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#xFF08;System Architecture&#xFF09;</li>
<li>&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#xFF08;Enterprise Architecture&#xFF09;&#xFF1A;&#x59CB;&#x4E8E; 20 &#x4E16;&#x7EAA;60 &#x5E74;&#x4EE3;&#xFF0C;&#x622A;&#x81F3;&#x76EE;&#x524D;&#x5DF2;&#x6709;&#x63A5;&#x8FD1;&#x516D;&#x5341;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x95E8;&#x5173;&#x952E;&#x7684; IT &#x5B66;&#x79D1;&#x9886;&#x57DF;&#xFF0C;&#x7ECF;&#x8FC7;&#x591A;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#x4E5F;&#x50AC;&#x751F;&#x4E86;&#x5404;&#x7C7B;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x5404;&#x884C;&#x4E1A;&#x548C;&#x5E94;&#x7528;&#x573A;&#x666F;&#x7684;&#x6846;&#x67B6;&#x4E0E;&#x65B9;&#x6CD5;&#x8BBA;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982; Zachman&#x3001;TOGAF&#x3001;DoDAF &#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#x4E5F;&#x4E00;&#x76F4;&#x4F5C;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x6307;&#x5BFC;&#x65B9;&#x6CD5;&#x548C;&#x5DE5;&#x5177;&#xFF0C;&#x88AB;&#x5E94;&#x7528;&#x4E8E;&#x5404;&#x7C7B;&#x4F01;&#x4E1A;&#x548C;&#x7EC4;&#x7EC7;&#x7684;&#x9876;&#x5C42; IT &#x89C4;&#x5212;&#x4E0E;&#x8BBE;&#x8BA1;&#x3002;</li>
<li>&#x89C6;&#x89D2;&#xFF08;viewpoint&#xFF09;&#xFF1A;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x56E0;&#x4E3A;&#x662F;&#x5728;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x672C;&#x8EAB;&#x7684;&#x8FDB;&#x884C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x56E0;&#x5176;&#x62BD;&#x8C61;&#x7A0B;&#x5EA6;&#x8F83;&#x9AD8;&#xFF0C;&#x540C;&#x65F6;&#x6D89;&#x53CA;&#x5404;&#x7C7B;&#x4E0D;&#x540C;&#x7684;&#x5E72;&#x7CFB;&#x4EBA;&#x548C;&#x7EC4;&#x7EC7;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5E72;&#x7CFB;&#x4EBA;&#x548C;&#x7EC4;&#x7EC7;&#x57FA;&#x4E8E;&#x81EA;&#x8EAB;&#x6240;&#x5904;&#x5C97;&#x4F4D;&#x89D2;&#x8272;&#x548C;&#x804C;&#x8D23;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x548C;&#x89C6;&#x89D2;&#x4E5F;&#x5B58;&#x5728;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89D2;&#xFF08;Viewpoint&#xFF09;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x4F53;&#x73B0;&#x6211;&#x4EEC;&#x5728;&#x5BA1;&#x89C6;&#x548C;&#x8FDB;&#x884C;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5904;&#x4E8E;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x548C;&#x89D2;&#x5EA6;&#xFF0C;&#x517C;&#x987E;&#x4E0D;&#x540C;&#x5E72;&#x7CFB;&#x4EBA;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8BC9;&#x6C42;&#x3002;</li>
<li>&#x89C6;&#x56FE;&#xFF08;view&#xFF09;&#xFF1A;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7684;&#x89C6;&#x89D2;&#xFF08;Viewpoint&#xFF09;&#x51FA;&#x53D1;&#xFF0C;&#x901A;&#x8FC7;&#x7EC4;&#x5408;&#x8FD9;&#x7C7B;&#x89C6;&#x89D2;&#x6240;&#x5173;&#x6CE8;&#x7684;&#x5143;&#x6A21;&#x578B;&#xFF08;Metamodel&#xFF09;&#x8981;&#x7D20;&#x53CA;&#x5176;&#x5173;&#x7CFB;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x4E0E;&#x5EFA;&#x6A21;&#x4E4B;&#x540E;&#xFF0C;&#x5F62;&#x6210;&#x7684;&#x5207;&#x9762;&#x89C6;&#x56FE;&#x3002;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#xFF08;View&#xFF09;&#x4F53;&#x73B0;&#x4E86;&#x5728;&#x4E00;&#x7C7B;&#x89C6;&#x89D2;&#xFF08;Viewpoint&#xFF09;&#x4E0B;&#x5BF9;&#x5176;&#x5173;&#x6CE8;&#x7684;&#x67B6;&#x6784;&#x5143;&#x6A21;&#x578B;&#x8981;&#x7D20;&#x53CA;&#x5176;&#x5173;&#x7CFB;&#x7684;&#x63CF;&#x8FF0;&#x548C;&#x53EF;&#x89C6;&#x5316;&#x3002;</li>
<li>&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#xFF08;Enterprise Architecture Framework&#xFF09;&#xFF1A;</li>
<li>&#x73B0;&#x4EE3;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#xFF08;Modern Enterprise Architecture Framework&#xFF09;&#xFF1A;&#x5728;&#x5145;&#x5206;&#x5438;&#x6536;&#x7ECF;&#x5178;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#x7684;&#x4F18;&#x79C0;&#x601D;&#x60F3;&#x548C;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x878D;&#x5408;&#x6700;&#x65B0;&#x7684;&#x4F01;&#x4E1A;&#x6570;&#x5B57;&#x5316;&#x53D1;&#x5C55;&#x7684;&#x9700;&#x6C42;&#x548C;&#x65B0;&#x6280;&#x672F;&#x65B0;&#x8D8B;&#x52BF;&#xFF0C;&#x52C7;&#x4E8E;&#x8DF3;&#x51FA; TOGAF &#x7684;&#x9650;&#x5236;&#xFF0C;&#x4ECE;&#x95EE;&#x9898;&#x51FA;&#x53D1;&#xFF0C;&#x56DE;&#x5F52;&#x7B2C;&#x4E00;&#x6027;&#xFF0C;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x548C;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#xFF0C;&#x5207;&#x5B9E;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4F01;&#x4E1A;&#x5728;&#x5411;&#x73B0;&#x4EE3;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x8FC7;&#x7A0B;&#x4E2D;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x548C;&#x6311;&#x6218;&#xFF0C;&#x5C31;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x548C;&#x7814;&#x7A76;&#x7684;&#x9886;&#x57DF;&#x3002;&#x901A;&#x8FC7;&#x51E0;&#x5E74;&#x7684;&#x7814;&#x7A76;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E5F;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x5957;&#x8F7B;&#x91CF;&#x5316;&#x3001;&#x654F;&#x6377;&#x53EF;&#x843D;&#x5730;&#x7684;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6846;&#x67B6;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5143;&#x6A21;&#x578B;&#xFF08;Metamodel&#xFF09;&#xFF1A;&#x5143;&#x6A21;&#x578B;&#x662F;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#x8981;&#x7D20;&#x7684;&#x7CBE;&#x786E;&#x5B9A;&#x4E49;&#x548C;&#x63CF;&#x8FF0;&#xFF0C;&#x5143;&#x6A21;&#x578B;&#x6784;&#x6210;&#x4E86;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x201C;&#x57FA;&#x672C;&#x8BED;&#x8A00;&#x8981;&#x7D20;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x5143;&#x6A21;&#x578B;&#x53CA;&#x5176;&#x5173;&#x7CFB;&#x7684;&#x8868;&#x8FBE;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#x548C;&#x5C55;&#x73B0;&#xFF0C;&#x6846;&#x67B6;&#x5143;&#x6A21;&#x578B;&#x4F53;&#x73B0;&#x4E86;&#x6846;&#x67B6;&#x8BBE;&#x8BA1;&#x8005;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x7EA7;&#x67B6;&#x6784;&#x672C;&#x8EAB;&#x7684;&#x7406;&#x89E3;&#x548C;&#x62BD;&#x8C61;&#xFF0C;&#x662F;&#x4F01;&#x4E1A;&#x7EA7;&#x67B6;&#x6784;&#x6846;&#x67B6;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x662F;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x63CF;&#x8FF0;&#x7684;&#x201C;&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#x201D;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x67B6;&#x6784; (Business Architecture) &#xFF1A;&#x4E1A;&#x52A1;&#x67B6;&#x6784;&#x662F;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#xFF0C;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x4E86;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x7684;&#x5B9E;&#x73B0;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x5176;&#x4ED6;&#x67B6;&#x6784;&#x9886;&#x57DF;&#x5DE5;&#x4F5C;&#x7684;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x548C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x4E3B;&#x8981;&#x4F9D;&#x636E;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x4F01;&#x4E1A;&#x5404;&#x7C7B;&#x4E1A;&#x52A1;&#x7684;&#x8FD0;&#x4F5C;&#x6A21;&#x5F0F;&#x53CA;&#x4E1A;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x5B83;&#x4EE5;&#x627F;&#x63A5;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x4E3A;&#x51FA;&#x53D1;&#x70B9;&#xFF0C;&#x4EE5;&#x652F;&#x6491;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x4E3A;&#x76EE;&#x6807;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x8BC6;&#x522B;&#x4E0E;&#x6784;&#x5EFA;&#xFF0C;&#x5E76;&#x5C06;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x4EE5;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#x900F;&#x51FA;&#xFF0C;&#x5B9E;&#x73B0;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x652F;&#x6491;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x901A;&#x8FC7;&#x7EC4;&#x7EC7;&#x7ED9;&#x4E88;&#x4FDD;&#x969C;&#x3002;&#x4E1A;&#x52A1;&#x67B6;&#x6784;&#x6574;&#x4F53;&#x4E0A;&#x5305;&#x62EC;&#x201C;&#x4E1A;&#x52A1;&#x201D;&#x3001;&#x201C;&#x6D41;&#x7A0B;&#x201D;&#x3001;&#x201C;&#x7EC4;&#x7EC7;&#x201D;&#x3001;&#x201C;&#x670D;&#x52A1;&#x201D;&#x3001;&#x201C;&#x9886;&#x57DF;&#x201D;&#x548C;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x516D;&#x5927;&#x90E8;&#x5206;&#x3002;</li>
<li>&#x80FD;&#x529B;&#xFF1A;&#x4F01;&#x4E1A;&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x3001;&#x591A;&#x573A;&#x666F;&#x548C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x5E73;&#x53F0;&#x4E0A;&#x6784;&#x5EFA;&#x53EF;&#x590D;&#x7528;&#x7684;&#x201C;&#x80FD;&#x529B;&#x201D;&#x4EE5;&#x53CA;&#x4E3A;&#x80FD;&#x529B;&#x63D0;&#x4F9B;&#x5FC5;&#x8981;&#x7684;&#x6269;&#x5C55;&#x4E0E;&#x53EF;&#x53D8;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x6B64;&#x4E3A;&#x4E0D;&#x540C;&#x524D;&#x53F0;&#x63D0;&#x4F9B;&#x7075;&#x6D3B;&#x591A;&#x53D8;&#x7684;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#xFF0C;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x524D;&#x53F0;&#x5DEE;&#x5F02;&#x5316;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x7684;&#x9700;&#x6C42;&#x3002;&#x201C;&#x80FD;&#x529B;&#x201D;&#x6839;&#x636E;&#x7C92;&#x5EA6;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x53EF;&#x518D;&#x5EA6;&#x7EC6;&#x5206;&#x4E3A;&#x201C;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x201D;&#x3001;&#x201C;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x201D;&#x548C;&#x201C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x201D;&#x4E09;&#x4E2A;&#x5C42;&#x7EA7;&#x3002;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#xFF0C;&#x5219;&#x53EF;&#x901A;&#x8FC7;&#x80FD;&#x529B;&#x7684;&#x201C;&#x6269;&#x5C55;&#x70B9;&#x201D;&#x8BBE;&#x8BA1;&#x548C;&#x4E0D;&#x540C;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x201D;&#x5728;&#x6269;&#x5C55;&#x70B9;&#x4E0A;&#x7684;&#x201C;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x201D;&#x8FDB;&#x884C;&#x533A;&#x5206;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#xFF1A;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x6700;&#x65E9;&#x7531;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x63D0;&#x51FA;&#xFF0C;&#x4E1A;&#x52A1;&#x5E73;&#x53F0;&#x5728;&#x5BF9;&#x5404;&#x4E1A;&#x52A1;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x80FD;&#x533A;&#x5206;&#x6BCF;&#x4E00;&#x6B21;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x7684;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x8981;&#x7D20;&#xFF0C;&#x4EE5;&#x4FBF;&#x63D0;&#x4F9B;&#x5DEE;&#x5F02;&#x5316;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x670D;&#x52A1;&#xFF1B;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;&#x4F01;&#x4E1A;&#x5404;&#x4E1A;&#x52A1;&#x7684;&#x8EAB;&#x4EFD;&#x548C;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x548C;&#x533A;&#x5206;&#xFF0C;&#x5176;&#x4EA7;&#x51FA;&#x5373;&#x4E3A;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x201D;&#x3002;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x662F;&#x4E1A;&#x52A1;&#x5728;&#x5E73;&#x53F0;&#x4E2D;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;&#x662F;&#x5728;&#x4E1A;&#x52A1;&#x8FD0;&#x8425;&#x4E2D;&#x552F;&#x4E00;&#x533A;&#x5206;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x7684; ID&#x3002;&#x5E73;&#x53F0;&#x57FA;&#x4E8E;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x5339;&#x914D;&#x8BE5;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x7684;&#x6D41;&#x7A0B;&#x548C;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x8DEF;&#x7531;&#x3001;&#x9700;&#x6C42;&#x6EAF;&#x6E90;&#x3001;&#x4E1A;&#x52A1;&#x76D1;&#x63A7;&#x548C;&#x4E1A;&#x52A1;&#x9694;&#x79BB;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x80FD;&#x529B;&#xFF1A;&#x662F;&#x5BF9;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x4E0A;&#x5355;&#x4E00;&#x4E14;&#x5B8C;&#x6574;&#x7684;&#x804C;&#x8D23;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x521B;&#x5EFA;&#x552E;&#x540E;&#x5355;&#x3001;&#x4FEE;&#x6539;&#x5546;&#x54C1;&#x5E93;&#x5B58;&#x91CF;&#x7B49;&#xFF0C;&#x662F;&#x80FD;&#x529B;&#x7EC4;&#x5408;&#x548C;&#x590D;&#x7528;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#x3002;</li>
<li>&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#xFF1A; &#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x662F;&#x5BF9;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x5C01;&#x88C5;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x65B9;&#x4FBF;&#x4E1A;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x6309;&#x5C01;&#x88C5;&#x7C92;&#x5EA6;&#x4E0D;&#x540C;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x7B2C;&#x4E00;&#x7C7B;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x7684;&#x9700;&#x8981;&#x7F16;&#x6392;&#x5C01;&#x88C5;&#x7684;&#x4E00;&#x7EC4;&#x5173;&#x8054;&#x7684;&#x57FA;&#x7840;&#x80FD;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x5B8C;&#x6574;&#x7684;&#x670D;&#x52A1;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x3002;&#x7B2C;&#x4E8C;&#x7C7B;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x662F;&#x5E73;&#x53F0;&#x9488;&#x5BF9;&#x4E00;&#x7CFB;&#x5217;&#x7D27;&#x5BC6;&#x5173;&#x8054;&#x7684;&#x4E1A;&#x52A1;&#x6D3B;&#x52A8;&#xFF0C;&#x8BBE;&#x8BA1;&#x7684;&#x80FD;&#x529B;&#x6A21;&#x677F;&#xFF0C;&#x53EF;&#x57FA;&#x4E8E;&#x8BE5;&#x6A21;&#x677F;&#x5FEB;&#x901F;&#x5B9A;&#x5236;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x7684;&#x7279;&#x5B9A;&#x6D41;&#x7A0B;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x590D;&#x7528;&#x5168;&#x90E8;&#x5173;&#x8054;&#x80FD;&#x529B;&#x7684;&#x76EE;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x201C;&#x7EC4;&#x5408;&#x652F;&#x4ED8;&#x201D;&#x3001;&#x201C;&#x5FEB;&#x901F;&#x5EFA;&#x7AD9;&#x201D;&#x7B49;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x3002;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x52A0;&#x5FEB;&#x4E86;&#x4E1A;&#x52A1;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8BA9;&#x4E1A;&#x52A1;&#x4FA7;&#x4E13;&#x6CE8;&#x4E1A;&#x52A1;&#x672C;&#x8EAB;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8017;&#x8D39;&#x7CBE;&#x529B;&#x5728;&#x7406;&#x89E3;&#x5E73;&#x53F0;&#x5927;&#x91CF;&#x7684;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4E0A;&#x3002;</li>
<li>&#x6269;&#x5C55;&#x70B9;&#x4E0E;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#xFF1A;&#x201C;&#x6269;&#x5C55;&#x70B9;&#x201D;&#x662F;&#x5BF9;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x7684;&#x53EF;&#x53D8;&#x6027;&#x8BBE;&#x8BA1;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x4FA7;&#x4F53;&#x73B0;&#x4E3A;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x5373;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x201D;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x8BA2;&#x5355;&#x6E32;&#x67D3;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x662F;&#x8BA2;&#x5355;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#xFF0C;&#x800C;&#x6B63;&#x5E38;&#x65F6;&#x671F;&#x7684;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x4E0E;&#x79D2;&#x6740;&#x65F6;&#x671F;&#x7684;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;&#x8BA2;&#x5355;&#x6E32;&#x67D3;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x8BBE;&#x8BA1;&#x201C;&#x8BA2;&#x5355;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x201D;&#x7684;&#x6269;&#x5C55;&#x70B9;&#xFF0C;&#x5E76;&#x5206;&#x522B;&#x5B9A;&#x4E49;&#x5728;&#x6B63;&#x5E38;&#x65F6;&#x671F;&#x548C;&#x79D2;&#x6740;&#x65F6;&#x671F;&#x7684;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x662F;&#x5E73;&#x53F0;&#x9488;&#x5BF9;&#x4E00;&#x7C7B;&#x5171;&#x6027;&#x4E1A;&#x52A1;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x8FC7;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x80FD;&#x529B;&#x6A21;&#x677F;&#xFF1B;&#x53EF;&#x57FA;&#x4E8E;&#x8BE5;&#x6A21;&#x677F;&#x5FEB;&#x901F;&#x5B9A;&#x5236;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x7684;&#x7279;&#x5B9A;&#x80FD;&#x529B;&#x548C;&#x6D41;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x4E1A;&#x52A1;&#x6A21;&#x5F0F;&#x7EA7;&#x522B;&#x590D;&#x7528;&#x7684;&#x76EE;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x865A;&#x62DF;&#x7269;&#x54C1;&#x4EA4;&#x6613;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
<li>&#x6D41;&#x7A0B;&#x5EFA;&#x6A21;&#xFF1A; &#x8D1F;&#x8D23;&#x8BC6;&#x522B;&#x5171;&#x6027;&#x4E1A;&#x52A1;&#xFF0C;&#x5E76;&#x62BD;&#x53D6;&#x901A;&#x7528;&#x6D41;&#x7A0B;&#xFF0C;&#x8BBE;&#x8BA1;&#x53EF;&#x53D8;&#x70B9;&#xFF0C;&#x4F5C;&#x4E3A;&#x53EF;&#x590D;&#x7528;&#x6027;&#x5206;&#x6790;&#x7684;&#x57FA;&#x7840;&#x3002;</li>
<li>&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#xFF1A; &#x8D1F;&#x8D23;&#x57FA;&#x4E8E;&#x6D41;&#x7A0B;&#x5EFA;&#x6A21;&#x7ED3;&#x679C;&#xFF0C;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x548C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5212;&#x5206;&#x5B50;&#x57DF;&#x7684;&#x8FB9;&#x754C;&#xFF1B;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x6784;&#x6210;&#x4E86;&#x63D0;&#x4F9B;&#x53EF;&#x590D;&#x7528;&#x80FD;&#x529B;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#xFF0C;&#x5BF9;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x64CD;&#x4F5C;&#x5373;&#x662F;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x5EFA;&#x6A21;&#xFF1A;&#x8D1F;&#x8D23;&#x5B9A;&#x4E49;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x8BC6;&#x522B;&#x7684;&#x8981;&#x7D20;&#x548C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x89E3;&#x6790;&#x89C4;&#x5219;&#xFF0C;&#x7528;&#x4E8E;&#x7ED9;&#x53EF;&#x590D;&#x7528;&#x7684;&#x80FD;&#x529B;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x8981;&#x7D20;&#x3002;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x7531;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD; ID&#x201D;&#x3001;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x540D;&#x79F0;&#x201D;&#x3001;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x8981;&#x7D20;&#x5B9A;&#x4E49;&#x201D;&#x3001;&#x201C;&#x4E1A;&#x52A1;&#x8EAB;&#x4EFD;&#x8BC6;&#x522B;&#x89E3;&#x6790;&#x89C4;&#x5219;&#x201D;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002;</li>
<li>&#x80FD;&#x529B;&#x5EFA;&#x6A21;&#xFF1A;&#x8D1F;&#x8D23;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x5E73;&#x53F0;&#x4E09;&#x7C7B;&#x53EF;&#x590D;&#x7528;&#x80FD;&#x529B;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5373;&#x201C;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x201D;&#x8BBE;&#x8BA1;&#x3001;&#x201C;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x201D;&#x8BBE;&#x8BA1;&#x548C;&#x201C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x201D;&#x8BBE;&#x8BA1;&#x3002;</li>
<li>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#xFF08;Domain Event&#xFF09;&#xFF1A;&#x662F;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x5173;&#x5FC3;&#x7684;&#xFF0C;&#x5728;&#x4E1A;&#x52A1;&#x4E0A;&#x771F;&#x5B9E;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x5BF9;&#x7CFB;&#x7EDF;&#x4F1A;&#x4EA7;&#x751F;&#x91CD;&#x8981;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x5C31;&#x4E0D;&#x80FD;&#x6210;&#x7ACB;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x5BF9;&#x8FC7;&#x53BB;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x8FDB;&#x884C;&#x6EAF;&#x6E90;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x53BB;&#x6240;&#x53D1;&#x751F;&#x7684;&#x5BF9;&#x4E1A;&#x52A1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x201C;&#x7528;&#x6237;&#x5730;&#x5740;&#x5DF2;&#x66F4;&#x65B0;&#x201D;&#x3001;&#x201C;&#x8BA2;&#x5355;&#x5DF2;&#x53D1;&#x8D27;&#x201D; &#x7B49;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x3002;</li>
<li>&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#xFF08;Event Storming&#xFF09;&#xFF1A;</li>
<li>&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF08;Domain Object&#xFF09;&#xFF1A;&#x662F;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x9AD8;&#x5EA6;&#x62BD;&#x8C61;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E1A;&#x52A1;&#x548C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#x6838;&#x5FC3;&#x8054;&#x7CFB;&#xFF0C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5C01;&#x88C5;&#x548C;&#x627F;&#x8F7D;&#x4E86;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;&#x3002;</li>
<li>&#x805A;&#x5408;&#x6839;&#xFF1A;&#x662F;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x6839;&#x8282;&#x70B9;&#xFF0C;&#x5177;&#x6709;&#x5168;&#x5C40;&#x6807;&#x8BC6;&#xFF0C;&#x5BF9;&#x8C61;&#x5176;&#x5B83;&#x7684;&#x5B9E;&#x4F53;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x805A;&#x5408;&#x6839;&#x6765;&#x5BFC;&#x822A;&#xFF1B;&#x5982;&#x8BA2;&#x5355;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x8BA2;&#x5355;&#x5934;&#x548C;&#x8BA2;&#x5355;&#x884C;&#xFF0C;&#x8BA2;&#x5355;&#x5934;&#x662F;&#x805A;&#x5408;&#x6839;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x8BA2;&#x5355;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF1B;&#x8BA2;&#x5355;&#x884C;&#x662F;&#x5B9E;&#x4F53;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x8BA2;&#x5355;&#x7684;&#x660E;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x805A;&#x5408;&#x8DDF;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x805A;&#x5408;&#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4FDD;&#x969C;&#xFF0C;&#x662F;&#x4E1A;&#x52A1;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x8FB9;&#x754C;&#x3002;</li>
<li>&#x5B9E;&#x4F53;&#xFF1A;&#x662F;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x4E3B;&#x5E72;&#xFF0C;&#x5177;&#x6709;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x548C;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6807;&#x8BC6;&#x5224;&#x65AD;&#x76F8;&#x7B49;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x5982;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x6237;&#x5B9E;&#x4F53;&#x3001;&#x8BA2;&#x5355;&#x5B9E;&#x4F53;&#xFF1B;</li>
<li>&#x503C;&#x5BF9;&#x8C61;&#xFF1A;&#x5B9E;&#x4F53;&#x7684;&#x9644;&#x52A0;&#x4E1A;&#x52A1;&#x6982;&#x5FF5;&#xFF0C;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5B9E;&#x4F53;&#x6240;&#x5305;&#x542B;&#x7684;&#x4E1A;&#x52A1;&#x4FE1;&#x606F;&#xFF0C;&#x65E0;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x53EF;&#x679A;&#x4E3E;&#x4E14;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x5982;&#x6536;&#x8D27;&#x5730;&#x5740;&#x3001;&#x5408;&#x540C;&#x79CD;&#x7C7B;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x5B50;&#x57DF;&#xFF08;Subdomain&#xFF09;&#xFF1A;&#x662F;&#x5BF9;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x6F84;&#x6E05;&#x548C;&#x5212;&#x5206;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5BF9;&#x4E8E;&#x8D44;&#x6E90;&#x6295;&#x5165;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x91CD;&#x8981;&#x53C2;&#x8003;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x201C;&#x8BA2;&#x5355;&#x5B50;&#x57DF;&#x201D;&#x3001;&#x201C;&#x7269;&#x6D41;&#x5B50;&#x57DF;&#x201D;&#x7B49;&#xFF0C;&#x5B50;&#x57DF;&#x7684;&#x5212;&#x5206;&#x4ECD;&#x5C5E;&#x4E8E;&#x4E1A;&#x52A1;&#x67B6;&#x6784;&#x5173;&#x6CE8;&#x8303;&#x7574;&#x3002;</li>
<li>&#x6838;&#x5FC3;&#x57DF;&#xFF08;Core Domain&#xFF09;&#xFF1A;&#x662F;&#x5F53;&#x524D;&#x4EA7;&#x54C1;&#x7684;&#x6838;&#x5FC3;&#x5DEE;&#x5F02;&#x5316;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x662F;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x7684;&#x76C8;&#x5229;&#x6765;&#x6E90;&#x548C;&#x57FA;&#x77F3;&#xFF0C;&#x5982;&#x679C;&#x6838;&#x5FC3;&#x57DF;&#x4E0D;&#x5B58;&#x5728;&#x90A3;&#x4E48;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x5C31;&#x4E0D;&#x80FD;&#x8FD0;&#x4F5C;&#x3002;&#x5BF9;&#x4E8E;&#x6838;&#x5FC3;&#x57DF;&#xFF0C;&#x9700;&#x8981;&#x6295;&#x5165;&#x6700;&#x4F18;&#x52BF;&#x7684;&#x8D44;&#x6E90;&#xFF08;&#x5305;&#x62EC;&#x80FD;&#x529B;&#x9AD8;&#x7684;&#x4EBA;&#xFF09;&#xFF0C;&#x548C;&#x505A;&#x4E25;&#x8C28;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</li>
<li>&#x652F;&#x6491;&#x57DF;&#xFF08;Supporting Subdomain&#xFF09;&#xFF1A;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x652F;&#x6491;&#x6838;&#x5FC3;&#x57DF;&#x8FD0;&#x4F5C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x4E0D;&#x5982;&#x6838;&#x5FC3;&#x57DF;&#xFF0C;&#x4F46;&#x5177;&#x5907;&#x5F3A;&#x70C8;&#x7684;&#x4E2A;&#x6027;&#x5316;&#x9700;&#x6C42;&#xFF0C;&#x96BE;&#x4EE5;&#x5728;&#x4E1A;&#x5185;&#x627E;&#x5230;&#x73B0;&#x6210;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x9700;&#x8981;&#x4E13;&#x95E8;&#x7684;&#x56E2;&#x961F;&#x5B9A;&#x5236;&#x5F00;&#x53D1;&#x3002;</li>
<li>&#x901A;&#x7528;&#x57DF;&#xFF08;Generic Subdomain&#xFF09;&#xFF1A;&#x8BE5;&#x7C7B;&#x95EE;&#x9898;&#x5728;&#x4E1A;&#x5185;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x53EF;&#x80FD;&#x6709;&#x73B0;&#x6210;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x901A;&#x8FC7;&#x8D2D;&#x4E70;&#x6216;&#x7B80;&#x5355;&#x4FEE;&#x6539;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x80FD;&#x529B;&#xFF1A;&#x662F;&#x5BF9;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x4E0A;&#x5355;&#x4E00;&#x4E14;&#x5B8C;&#x6574;&#x7684;&#x804C;&#x8D23;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x521B;&#x5EFA;&#x552E;&#x540E;&#x5355;&#x3001;&#x4FEE;&#x6539;&#x5546;&#x54C1;&#x5E93;&#x5B58;&#x91CF;&#x7B49;&#x3002;</li>
<li>&#x6269;&#x5C55;&#x70B9;&#x4E0E;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#xFF1A;&#x201C;&#x6269;&#x5C55;&#x70B9;&#x201D;&#x662F;&#x5BF9;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x7684;&#x53EF;&#x53D8;&#x6027;&#x8BBE;&#x8BA1;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x4FA7;&#x4F53;&#x73B0;&#x4E3A;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x201D;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x8BA2;&#x5355;&#x6E32;&#x67D3;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x662F;&#x8BA2;&#x5355;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#xFF0C;&#x800C;&#x6B63;&#x5E38;&#x65F6;&#x671F;&#x7684;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x4E0E;&#x79D2;&#x6740;&#x65F6;&#x671F;&#x7684;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;&#x8BA2;&#x5355;&#x6E32;&#x67D3;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x8BBE;&#x8BA1;&#x201C;&#x8BA2;&#x5355;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x89C4;&#x5219;&#x201D;&#x7684;&#x6269;&#x5C55;&#x70B9;&#xFF0C;&#x5E76;&#x5206;&#x522B;&#x5B9A;&#x4E49;&#x5728;&#x6B63;&#x5E38;&#x65F6;&#x671F;&#x548C;&#x79D2;&#x6740;&#x65F6;&#x671F;&#x7684;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#xFF1A;&#x662F;&#x5BF9;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x5C01;&#x88C5;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x65B9;&#x4FBF;&#x4E1A;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x80FD;&#x529B;&#x7EC4;&#x4EF6;&#x52A0;&#x5FEB;&#x4E86;&#x4E1A;&#x52A1;&#x63A5;&#x5165;&#x5E73;&#x53F0;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8BA9;&#x4E1A;&#x52A1;&#x4FA7;&#x4E13;&#x6CE8;&#x4E1A;&#x52A1;&#x672C;&#x8EAB;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8017;&#x8D39;&#x7CBE;&#x529B;&#x5728;&#x7406;&#x89E3;&#x5E73;&#x53F0;&#x5927;&#x91CF;&#x7684;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4E0A;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x7EF4;&#x5EA6;&#xFF1A;&#x6B64;&#x7EF4;&#x5EA6;&#x4E3B;&#x8981;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x4E1A;&#x52A1;&#x7EC4;&#x5408;&#x7BA1;&#x7406;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x5206;&#x6790;&#x4F01;&#x4E1A;&#x5404;&#x4E3B;&#x8425;&#x4E1A;&#x52A1;&#x548C;&#x8F85;&#x52A9;&#x4E1A;&#x52A1;&#x7684;&#x5173;&#x7CFB;&#x7ED3;&#x6784;&#x53CA;&#x8FD0;&#x4F5C;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x7FA4;&#xFF1A;&#x662F;&#x4F01;&#x4E1A;&#x57FA;&#x4E8E;&#x4E1A;&#x52A1;&#x6218;&#x7565;&#x62C6;&#x89E3;&#xFF0C;&#x786E;&#x5B9A;&#x5F00;&#x5C55;&#x7684;&#x7279;&#x5B9A;&#x7ECF;&#x8425;&#x6D3B;&#x52A8;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5F00;&#x5C55; ToC &#x7684;&#x7535;&#x5546;&#x5E73;&#x53F0;&#x7ECF;&#x8425;&#x6D3B;&#x52A8;&#xFF0C;&#x5176;&#x4E0B;&#x53C8;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5206;&#x4E3A;&#x5FEB;&#x6D88;&#x54C1;&#x4E1A;&#x52A1;&#x7FA4;&#x548C;&#x6D88;&#x8D39;&#x7535;&#x5B50;&#x4E1A;&#x52A1;&#x7FA4;&#x7B49;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#xFF1A;&#x662F;&#x4E1A;&#x52A1;&#x7FA4;&#x4E0B;&#x5177;&#x6709;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x7684;&#x4E1A;&#x52A1;&#x5355;&#x5143;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5B9E;&#x4F53;&#x5546;&#x54C1;&#x4E1A;&#x52A1;&#x3001;&#x751F;&#x6D3B;&#x670D;&#x52A1;&#x4E1A;&#x52A1;&#x7B49;&#xFF1B;&#x5185;&#x90E8;&#x652F;&#x6491;&#x7C7B;&#x7684;&#x4E1A;&#x52A1;&#x6BD4;&#x5982;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7B49;&#x3002;</li>
<li>&#x573A;&#x666F;&#xFF1A;&#x662F;&#x9762;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4EF7;&#x503C;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x3002;&#x901A;&#x5E38;&#x4ECE; 4W1H&#xFF08;What&#x3001;Who&#x3001;Where&#x3001;When&#x3001;How&#xFF09;&#x7684;&#x7EF4;&#x5EA6;&#x8BC6;&#x522B;&#x548C;&#x5B9A;&#x4E49;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x8981;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x8981;&#x7D20;&#x7684;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x4E2D;&#x7B5B;&#x9009;&#x51FA;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x3002;</li>
<li>&#x6D41;&#x7A0B;&#x7EF4;&#x5EA6;&#xFF1A;&#x4E3B;&#x8981;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x5206;&#x5C42;&#x5EFA;&#x6A21;&#xFF0C;&#x5206;&#x6790;&#x4F01;&#x4E1A;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x4E1A;&#x52A1;&#x6D3B;&#x52A8;&#xFF0C;&#x6309;&#x7167;&#x76F8;&#x5173;&#x7684;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x5C06;&#x8F93;&#x5165;&#x8F6C;&#x6362;&#x6210;&#x4E3A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x4EF7;&#x503C;&#x3002;</li>
<li>&#x9636;&#x6BB5;&#xFF1A;&#x5373;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x9636;&#x6BB5;&#xFF0C;&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x7528;&#x6237;&#x7684;&#x53CA;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x4E1A;&#x52A1;&#x6D3B;&#x52A8;&#xFF0C;&#x7528;&#x4EE5;&#x5B9E;&#x73B0;&#x9636;&#x6BB5;&#x6027;&#x4EF7;&#x503C;&#x4EA4;&#x4ED8;&#x7684;&#x76EE;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x552E;&#x524D;&#x3001;&#x552E;&#x4E2D;&#x548C;&#x552E;&#x540E;&#x7B49;&#x3002;</li>
<li>&#x6D3B;&#x52A8;&#xFF1A;&#x5373;&#x4E1A;&#x52A1;&#x6D3B;&#x52A8;&#xFF0C;&#x662F;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x89D2;&#x8272;&#x529E;&#x7406;&#x7684;&#x4E1A;&#x52A1;&#x4E8B;&#x9879;&#xFF0C;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x7EC4;&#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x660E;&#x786E;&#x7684;&#x4E1A;&#x52A1;&#x6210;&#x679C;&#x548C;&#x4E1A;&#x52A1;&#x8F93;&#x51FA;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5546;&#x54C1;&#x53D1;&#x5E03;&#x3001;&#x6D3B;&#x52A8;&#x53D1;&#x5E03;&#x7B49;&#x3002;</li>
<li>&#x4EFB;&#x52A1;&#xFF1A;&#x662F;&#x5B8C;&#x6210;&#x6D3B;&#x52A8;&#x7684;&#x5DE5;&#x4F5C;&#x7A0B;&#x5E8F;&#xFF0C;&#x662F;&#x6D41;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x5355;&#x5143;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x67E5;&#x8BE2;&#x5546;&#x54C1;&#x8BE6;&#x60C5;&#x3001;&#x66F4;&#x65B0;&#x5546;&#x54C1;&#x5E93;&#x5B58;&#x3001;&#x521B;&#x5EFA;&#x8BA2;&#x5355;&#x7B49;&#x3002;</li>
<li>&#x6B65;&#x9AA4;&#xFF1A;&#x662F;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x5177;&#x4F53;&#x6B65;&#x9AA4;&#xFF0C;&#x662F;&#x6D41;&#x7A0B;&#x7684;&#x6700;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x6821;&#x9A8C;&#x7528;&#x6237;&#x72B6;&#x6001;&#x3001;&#x6821;&#x9A8C;&#x5546;&#x6237;&#x72B6;&#x6001;&#x3001;&#x8BA2;&#x5355;&#x603B;&#x4EF7;&#x8BD5;&#x7B97;&#x7B49;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#xFF1A;&#x662F;&#x5B9A;&#x4E49;&#x6216;&#x7EA6;&#x675F;&#x4E1A;&#x52A1;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x9648;&#x8FF0;&#xFF0C;&#x65E8;&#x5728;&#x7EF4;&#x62A4;&#x4E1A;&#x52A1;&#x7ED3;&#x6784;&#x6216;&#x63A7;&#x5236;&#x6216;&#x5F71;&#x54CD;&#x4E1A;&#x52A1;&#x884C;&#x4E3A;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x4E1A;&#x52A1;&#x8FC7;&#x7A0B;&#x4E0E;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x3002;&#x6BD4;&#x5982;&#xFF1A;if&#x8BA2;&#x5355;.&#x63D0;&#x8D27;&#x65B9;&#x5F0F;=&#x201C;&#x90AE;&#x5BC4;&#x201D;&#x4E14; &#x8BA2;&#x5355; . &#x652F;&#x4ED8;&#x72B6;&#x6001; =&#x201C;&#x5DF2;&#x652F;&#x4ED8;&#x201D; then &#x201C;&#x521B;&#x5EFA;&#x7269;&#x6D41;&#x5355;&#x201D;&#x3002;</li>
<li>&#x7EC4;&#x7EC7;&#x7EF4;&#x5EA6;&#xFF1A;&#x4E3B;&#x8981;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x7EC4;&#x7EC7;&#x4F53;&#x7CFB;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;&#x516C;&#x53F8;&#x7EC4;&#x7EC7;&#x4F53;&#x7CFB;&#x6307;&#x4E3A;&#x4E86;&#x4FDD;&#x969C;&#x6218;&#x7565;&#x548C;&#x4E1A;&#x52A1;&#x89C4;&#x5212;&#x843D;&#x5730;&#xFF0C;&#x4EE5;&#x53CA;&#x6709;&#x6548;&#x5B9E;&#x65BD;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x4F53;&#x7CFB;&#xFF0C;&#x516C;&#x53F8;&#x91C7;&#x53D6;&#x7684;&#x7EC4;&#x7EC7;&#x67B6;&#x6784;&#x548C;&#x7BA1;&#x63A7;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x7EC4;&#x7EC7;&#x5355;&#x5143;&#xFF1A;&#x662F;&#x516C;&#x53F8;&#x7EC4;&#x7EC7;&#x4F53;&#x7CFB;&#x7684;&#x7EC4;&#x6210;&#x5355;&#x5143;&#x3002;</li>
<li>&#x5C97;&#x4F4D;&#xFF1A;&#x662F;&#x968F;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x8BBE;&#x5B9A;&#x7684;&#xFF0C;&#x8981;&#x6C42;&#x4E2A;&#x4F53;&#x5B8C;&#x6210;&#x7684;&#x4E00;&#x9879;&#x6216;&#x591A;&#x9879;&#x8D23;&#x4EFB;&#x4EE5;&#x53CA;&#x4E3A;&#x6B64;&#x8D4B;&#x4E88;&#x4E2A;&#x4F53;&#x7684;&#x6743;&#x529B;&#x7684;&#x603B;&#x548C;&#x3002;</li>
<li>&#x89D2;&#x8272;&#xFF1A;&#x662F;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x4E2D;&#x6D3B;&#x52A8;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x539F;&#x578B;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x5728;&#x6D41;&#x7A0B;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x901A;&#x8FC7;&#x62C5;&#x4EFB;&#x5408;&#x9002;&#x7684;&#x89D2;&#x8272;&#x786E;&#x5B9A;&#x3002;&#x7EC4;&#x7EC7;&#x4E3A;&#x5B8C;&#x6210;&#x67D0;&#x4E00;&#x76EE;&#x6807;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x628A;&#x6B64;&#x76EE;&#x6807;&#x5206;&#x89E3;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x4EA4;&#x7ED9;&#x4E0D;&#x540C;&#x80FD;&#x529B;&#x548C;&#x8D23;&#x4EFB;&#x7684;&#x89D2;&#x8272;&#x5408;&#x4F5C;&#x5B8C;&#x6210;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x7EF4;&#x5EA6;&#xFF1A;&#x4E3B;&#x8981;&#x5BF9;&#x4F01;&#x4E1A;&#x5BF9;&#x5185;&#x548C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x7684;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x5206;&#x6790;&#x3002;</li>
<li>&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#xFF1A;&#x662F;&#x4F01;&#x4E1A;&#x548C;&#x4F01;&#x4E1A;&#x7684;&#x6BCF;&#x4E2A;&#x4E1A;&#x52A1;&#x5355;&#x5143;&#x4E3A;&#x5176;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x5185;&#x90E8;&#x548C;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x3002;&#x670D;&#x52A1;&#x662F;&#x80FD;&#x529B;&#x5BF9;&#x5916;&#x5448;&#x73B0;&#x4EF7;&#x503C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x5177;&#x5907;&#x660E;&#x786E;&#x7684;&#x4E1A;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x72EC;&#x7ACB;&#x5B8C;&#x6574;&#x3001;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5173;&#x8054;&#x7D27;&#x5BC6;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x5408;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5F00;&#x6237;&#x3001;&#x63D0;&#x4EA4;&#x8BA2;&#x5355;&#x7B49;&#x3002;</li>
<li>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;Boundary Context&#xFF09;&#xFF1A;&#x662F;&#x4E1A;&#x52A1;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x5728;&#x8BE5;&#x8FB9;&#x754C;&#x5185;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x53BB;&#x4EA4;&#x6D41;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x6982;&#x5FF5;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7406;&#x89E3;&#x548C;&#x8BA4;&#x77E5;&#x4E0A;&#x7684;&#x6B67;&#x4E49;&#xFF08;&#x4E8C;&#x4E49;&#x6027;&#xFF09;&#xFF0C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#x7684;&#x91CD;&#x8981;&#x4FDD;&#x8BC1;&#x3002;</li>
<li>&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#xFF08;Ubiquitous Language&#xFF09;&#xFF1A;&#x662F; Eric Evans&#x5728;&#x300A;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1; - &#x5904;&#x7406;&#x8F6F;&#x4EF6;&#x6838;&#x5FC3;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x6027;&#x300B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x7531;&#x56E2;&#x961F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x548C;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x8005;&#x5171;&#x4EAB;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x7684;&#x8BED;&#x8A00;&#x3001;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3001;&#x6CDB;&#x5728;&#x8BED;&#x8A00;&#x3002;&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#x662F;&#x5728;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5EFA;&#x6A21;&#x7684;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x6807;&#x8BC6;&#x8868;&#x8FBE;&#x4E86;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x7684;&#x672F;&#x8BED;&#x548C;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x6B67;&#x4E49;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x7EC4;&#xFF1A;&#x662F;&#x4E00;&#x79CD;&#x5927;&#x6BD4;&#x4F8B;&#x7ED3;&#x6784;&#x7684;&#x903B;&#x8F91;&#x8FB9;&#x754C;&#x5212;&#x5206;&#x7ED3;&#x6784;</li>
<li>&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#xFF1A;&#x662F;&#x4E00;&#x79CD;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x8FB9;&#x754C;&#x5212;&#x5206;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x5BF9;&#x529F;&#x80FD;&#x3001;&#x6570;&#x636E;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x6309;&#x804C;&#x8D23;&#x7C7B;&#x578B;&#x5206;&#x89E3;&#xFF0C;&#x6D41;&#x8F6C;&#x7C7B;&#x3001;&#x89C4;&#x683C;&#x7C7B;&#x3001;&#x89C6;&#x56FE;&#x7C7B;&#x3001;&#x914D;&#x7F6E;&#x7C7B;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x5C42;&#x5EFA;&#x6A21;&#xFF1A;&#x9664;&#x4E86;&#x5E94;&#x7528;&#x7EC4;&#x4E4B;&#x5916;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x79CD;&#x5927;&#x6BD4;&#x4F8B;&#x7ED3;&#x6784;&#x662F;&#x5206;&#x5C42;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E5F;&#x5C06;&#x5E94;&#x7528;&#x5C42;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#x52A0;&#x5165;&#x8FDB;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5206;&#x5C42;&#x4EE3;&#x8868;&#x4E86;&#x4F01;&#x4E1A;&#x5BF9;&#x53D8;&#x5316;&#x901F;&#x7387;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x5E76;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x5316;&#x901F;&#x7387;&#x5339;&#x914D;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x548C;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF1A;&#x5143;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x663E;&#x5F0F;&#x5730;&#x5411;&#x5BF9;&#x5916;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5951;&#x7EA6;&#x3002;&#x8FD9;&#x5728;&#x505A;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x5347;&#x7EA7; / &#x66FF;&#x6362;&#x3001;&#x5B9A;&#x4E49;IT &#x670D;&#x52A1;&#x7EA7;&#x522B;&#x7B49;&#x67B6;&#x6784;&#x6CBB;&#x7406;&#x573A;&#x666F;&#x4E2D;&#x4F1A;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x6765;&#x5BF9;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7684;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x529F;&#x80FD;&#x96C6;&#x5408;&#x5EFA;&#x6A21;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5206;&#x6790;&#x4E09;&#x5927;&#x5DE5;&#x5E8F;&#xFF1A;&#x6444;&#x53D6;&#xFF08;Ingest&#xFF09;- &#x52A0;&#x5DE5;&#xFF08;Process&#xFF09;- &#x80FD;&#x529B;&#x5305;&#x88C5;&#xFF08;Serve&#xFF09;</li>
<li>&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF1A;&#x662F;&#x6570;&#x636E;&#x67B6;&#x6784;&#x7684;&#x6838;&#x5FC3;&#x6A21;&#x578B;&#xFF0C;&#x662F;&#x4ECE;&#x6570;&#x636E;&#x89C6;&#x89D2;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7279;&#x5F81;&#x7684;&#x6A21;&#x62DF;&#x548C;&#x62BD;&#x8C61;&#x3002;</li>
<li>&#x8D34;&#x6E90;&#x5C42;&#xFF1A;&#x8D34;&#x6E90;&#x4EE3;&#x8868;&#x7D27;&#x9760;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x81EA;&#x8EAB;&#x7684;&#x4E1A;&#x52A1;&#x8FD0;&#x8425;&#x5206;&#x6790;&#x9700;&#x6C42;&#xFF0C;&#x5176;&#x9700;&#x8981;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x539F;&#x6599;&#x5C31;&#x5728;&#x652F;&#x6491;&#x8FD9;&#x4E2A;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x9700;&#x6C42;&#x548C;&#x5B9E;&#x73B0;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9500;&#x552E;&#x7EBF;&#x7D22;&#x54CD;&#x5E94;&#x7684;&#x524D;&#x7F6E;&#x65F6;&#x95F4;&#x8D8B;&#x52BF;&#xFF0C;&#x5176;&#x4F9D;&#x8D56;&#x7684;&#x4E3B;&#x8981;&#x6570;&#x636E;&#x539F;&#x6599;&#x662F;&#x9500;&#x552E;&#x7EBF;&#x7D22;&#x7684;&#x8DDF;&#x8FDB;&#x4E8B;&#x4EF6;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x5728;&#x9500;&#x552E;&#x7EBF;&#x7D22;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x6E90;&#x91CC;&#x3002;</li>
<li>&#x884D;&#x751F;&#x5C42;&#xFF1A;&#x5728;&#x8D34;&#x6E90;&#x5C42;&#x4E4B;&#x4E0A;&#x7684;&#x662F;&#x884D;&#x751F;&#x5C42;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5206;&#x6790;&#x7C7B;&#x573A;&#x666F;&#x9700;&#x8981;&#x6574;&#x5408;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x6E90;&#x7684;&#x6570;&#x636E;&#x539F;&#x6599;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x4E2D;&#x95F4;&#x5904;&#x7406;&#xFF0C;&#x5B9E;&#x73B0;&#x96BE;&#x5EA6;&#x8F83;&#x9AD8;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x6C42;&#x548C;&#x5B9E;&#x73B0;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x53D8;&#x5316;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6574;&#x5408;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x6E90;&#x7684;&#x5BA2;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#xFF0C;&#x4E3A;&#x5BA2;&#x6237;&#x6253;&#x4E0A;&#x6807;&#x7B7E;&#x3002;</li>
<li>&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x5143;&#x6A21;&#x578B;&#xFF1A;&#x6A21;&#x5F0F;&#x5206;&#x6790;&#x662F;&#x5FEB;&#x901F;&#x8BA4;&#x8BC6;&#x95EE;&#x9898;&#x672C;&#x8D28;&#x4EE5;&#x53CA;&#x7ECF;&#x9A8C;&#x590D;&#x7528;&#x7684;&#x6709;&#x6548;&#x5B9E;&#x8DF5;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5143;&#x6A21;&#x578B;&#x5185;&#x5BB9;&#x4E2D;&#x589E;&#x52A0;&#x4E86;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x6A21;&#x578B;&#xFF0C;&#x5F15;&#x5165;&#x6A21;&#x5F0F;&#x5206;&#x6790;&#x89C6;&#x89D2;&#xFF0C;&#x5BF9;&#x4E0A;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x3001;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x5EFA;&#x6A21;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x5FEB;&#x901F;&#x3001;&#x51C6;&#x786E;&#x5B9A;&#x4F4D;&#x8BBE;&#x8BA1;&#x548C;&#x590D;&#x7528;&#x6280;&#x672F;&#x65B9;&#x6848;&#x3002;</li>
<li>&#x67B6;&#x6784;&#x65B9;&#x6848;&#x5143;&#x6A21;&#x578B;&#xFF1A;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x6A21;&#x578B;&#x662F;&#x63CF;&#x8FF0;&#x6280;&#x672F;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x6838;&#x5FC3;&#x5143;&#x6A21;&#x578B;&#xFF0C;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x6838;&#x5FC3;&#x5143;&#x7D20;&#x3002;&#x57FA;&#x4E8E;&#x5E73;&#x53F0;&#x578B;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x6280;&#x672F;&#x8BBE;&#x8BA1;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x5E73;&#x53F0;&#x3001;&#x670D;&#x52A1;&#x3001;&#x7EC4;&#x4EF6;&#x8FD9;&#x4E09;&#x4E2A;&#x5C42;&#x6B21;&#x9012;&#x8FDB;&#x7684;&#x5143;&#x7D20;&#x5BF9;&#x6280;&#x672F;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;</li>
<li>&#x67B6;&#x6784;&#x7B56;&#x7565;&#x5143;&#x6A21;&#x578B;&#xFF1A;&#x67B6;&#x6784;&#x7B56;&#x7565;&#x6A21;&#x578B;&#x662F;&#x4E3A;&#x4E86;&#x7EA6;&#x675F;&#x548C;&#x89C4;&#x8303;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#xFF0C;&#x4FDD;&#x8BC1;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x9075;&#x5FAA;&#x4F01;&#x4E1A;&#x6574;&#x4F53;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x613F;&#x666F;&#x4E0E;&#x9700;&#x6C42;&#xFF0C;&#x7B26;&#x5408;&#x4F01;&#x4E1A;&#x6574;&#x4F53;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4E0E;&#x89C4;&#x8303;&#xFF0C;&#x662F;&#x5BF9;&#x4E8E;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#x7684;&#x7EA6;&#x675F;&#x548C;&#x6307;&#x5BFC;&#x3002;</li>
<li>&#x95EE;&#x9898; Problem&#xFF1A;&#x95EE;&#x9898;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x5BF9;&#x4E0A;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8F93;&#x5165;&#x7684;&#x5206;&#x6790;&#x548C;&#x89E3;&#x8BFB;&#x3002;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x4E86;&#x67B6;&#x6784;&#x9700;&#x6C42;&#x80CC;&#x540E;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F8B;&#x5982;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#x4E2D;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x524D;&#x53F0;&#x83B7;&#x5F97;&#x4E00;&#x81F4;&#x7684;&#x670D;&#x52A1;&#x7B49;&#x7EA7;&#x627F;&#x8BFA;&#xFF08;SLA&#xFF09;&#x3002;</li>
<li>&#x4E0A;&#x4E0B;&#x6587; Context&#xFF1A;&#x95EE;&#x9898;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x5BF9;&#x4E0A;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8F93;&#x5165;&#x7684;&#x5206;&#x6790;&#x548C;&#x89E3;&#x8BFB;&#x3002;&#x4E0A;&#x4E0B;&#x6587;&#x63CF;&#x8FF0;&#x4E86;&#x4E0E;&#x95EE;&#x9898;&#x76F8;&#x5173;&#x7684;&#x80CC;&#x666F;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x95EE;&#x9898;&#x4EA7;&#x751F;&#x7684;&#x80CC;&#x666F;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x4EC0;&#x4E48;&#x6837;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF0C;&#x671F;&#x671B;&#x8FBE;&#x5230;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6548;&#x679C;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x6A21;&#x5F0F; Pattern&#xFF1A;&#x6A21;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x95EE;&#x9898;&#x548C;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x5FEB;&#x901F;&#x6620;&#x5C04;&#x5230;&#x7684;&#x4E1A;&#x754C;&#x6216;&#x4F01;&#x4E1A;&#x5185;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;&#x6A21;&#x5F0F;&#x662F;&#x89E3;&#x51B3;&#x67D0;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#x539F;&#x7406;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x901A;&#x8FC7;&#x6A21;&#x5F0F;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x6784;&#x6210;&#x5BF9;&#x95EE;&#x9898;&#x53CA;&#x65B9;&#x6848;&#x80CC;&#x540E;&#x539F;&#x7406;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5728;&#x95EE;&#x9898;&#x4E0D;&#x53D8;&#x65F6;&#xFF0C;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x76F8;&#x5BF9;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x662F;&#x6C89;&#x6DC0;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#x7684;&#x6700;&#x4F73;&#x5F62;&#x5F0F;&#x3002;</li>
<li>&#x51B3;&#x7B56; Decision&#xFF1A;&#x51B3;&#x7B56;&#x63CF;&#x8FF0;&#x4E86;&#x5728;&#x6A21;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5F15;&#x5165;&#x4E0E;&#x5177;&#x4F53;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#x540E;&#xFF0C;&#x5F62;&#x6210;&#x7684;&#x7B26;&#x5408;&#x6EE1;&#x8DB3;&#x67B6;&#x6784;&#x5EFA;&#x8BBE;&#x9700;&#x6C42;&#x7684;&#x6280;&#x672F;&#x7C7B;&#x51B3;&#x7B56;&#xFF0C;&#x51B3;&#x7B56;&#x7684;&#x63CF;&#x8FF0;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#x51B3;&#x7B56;&#x6811;&#x6216;&#x51B3;&#x7B56;&#x8868;&#x3002;</li>
<li>&#x6280;&#x672F;&#x7EC4;&#x4EF6; Component&#xFF1A;&#x6280;&#x672F;&#x7EC4;&#x4EF6;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x6280;&#x672F;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x662F;&#x53EF;&#x90E8;&#x7F72;&#x7684;&#x7269;&#x7406;&#x7EC4;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6216;&#x6784;&#x5EFA;&#x6253;&#x5305;&#x540E;&#x7684;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#xFF0C;&#x6280;&#x672F;&#x7EC4;&#x4EF6;&#x901A;&#x8FC7;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x7684;&#x51B3;&#x7B56;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;&#x6280;&#x672F;&#x9009;&#x578B;&#x8FDB;&#x884C;&#x5173;&#x8054;&#x3002;</li>
<li>&#x6280;&#x672F;&#x670D;&#x52A1; Service&#xFF1A;&#x6280;&#x672F;&#x670D;&#x52A1;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5B9E;&#x73B0;&#x4E0A;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x6240;&#x9700;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF08;&#x6216;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x5173;&#x3001;&#x9632;&#x706B;&#x5899;&#x3001;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3001;&#x7F13;&#x5B58;&#x7B49;&#x3002;&#x6280;&#x672F;&#x670D;&#x52A1;&#x5C5E;&#x4E8E;&#x903B;&#x8F91;&#x6A21;&#x578B;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5BF9;&#x670D;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684; SLA &#x7B49;&#x8DE8;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x4F1A;&#x540C;&#x65F6;&#x4F5C;&#x4E3A;&#x5176;&#x53C2;&#x8003;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x6280;&#x672F;&#x5E73;&#x53F0; Platform&#xFF1A;&#x6280;&#x672F;&#x5E73;&#x53F0;&#x662F;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x7531;&#x4E00;&#x7EC4;&#x6280;&#x672F;&#x670D;&#x52A1;&#x6784;&#x6210;&#xFF0C;&#x63D0;&#x4F9B;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x6280;&#x672F;&#x9886;&#x57DF;&#x80FD;&#x529B;&#x7684;&#x903B;&#x8F91;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4ECE;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#x5BF9;&#x6280;&#x672F;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x7B80;&#x5316;&#x67B6;&#x6784;&#x53C2;&#x4E0E;&#x8005;&#x5BF9;&#x590D;&#x6742;&#x67B6;&#x6784;&#x7684;&#x7406;&#x89E3;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x7EDF;&#x4E00;&#x5BF9;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;SLA &#x670D;&#x52A1;&#x627F;&#x8BFA;&#x3002;</li>
<li>&#x7ECF;&#x9A8C;&#xFF1A;&#x7ECF;&#x9A8C;&#x662F;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E2D;&#x5BF9;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x5E94;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x8BB0;&#x5F55;&#xFF0C;&#x7ECF;&#x9A8C;&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x5BF9;&#x6A21;&#x5F0F;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x5E94;&#x7528;&#x6A21;&#x5F0F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x7ECF;&#x9A8C;&#x7684;&#x5185;&#x5BB9;&#x7531;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x5143;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x3001;&#x4E0A;&#x4E0B;&#x6587;&#x3001;&#x51B3;&#x7B56;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x5BF9;&#x5E94;&#x7684;&#x53C2;&#x8003;&#x6A21;&#x578B;&#x5C55;&#x5F00;&#x63CF;&#x8FF0;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9-appendix.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 9. 作者">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"10. 概念","level":"1.11","depth":1,"previous":{"title":"9. 作者","level":"1.10","depth":1,"path":"9-appendix.md","ref":"./9-appendix.md","articles":[]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"现代企业架构框架(MEAF)","gitbook":"*","description":"在线阅读版（仅供个人学习用）"},"file":{"path":"10-concept.md","mtime":"2022-10-02T04:23:20.735Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-03T02:36:02.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

